alert('Привет, мир!');

// 1
console.log('Общая сумма бюджета для фильма:', 70000000 + 20000000);
console.log('Количество нереализованных Иннокентием задач заказчика:', Math.abs((5/2-4)*4));
console.log('Останутся неподготовленными из-за вредности верстальщиков:', 20 % 3);


// 2
alert('Прочти меня и сразу же закрой!');
console.log('Пяти' + 'этажка');
console.log('Владивосток' + ' ' + '2000');
console.log(`Первое произведение А.С. Пушкина было опубликовано в ${1799 + 12 + 3} году`);

// 3
let fahrenheit = (451);
console.log(fahrenheit);
let celsius = Math.round((fahrenheit - 32) / 1.8);
console.log(celsius);
console.log(`${fahrenheit} градуса по Фаренгейту - это ${celsius} градуса по Цельсию`);
